In [7]:
-- Daj tam cele cislo/int 1
-- Jednoriadkovy komentar v jazyku SQL
select 1;
-- Daj tam retazec/varchar Ahoj svet
select "Ahoj svet";
-- Daj tam float/real 999.99 
select 999.99;
-- Daj tam date/datum
select "2022-10-3";

,2022-10-3
0,2022-10-3

In [11]:
-- Zoznam vsetkych databaz
show databases;
-- Zoznam vsetkych tabuliek
show tables;
-- Zoznam vsetkych pouzitelov
show users;
show views;

,Tables_in_Kurz_SQL
0,Album
1,City
2,DEPT
3,Data_SQLZoo_Nobel_csv
4,Data_SQLZoo_World_csv
5,EMP
6,T1
7,T10
8,T100
9,World
10,world_csv

In [15]:
-- Vypis nazov db, na ktoru si pripojeny
select DATABASE();
use Kurz_SQL;
select DATABASE();

,DATABASE()
0,Kurz_SQL

In [22]:
-- select * from World;
-- select name, area, population from World;
-- select area, area/1000, population, name  from World;
-- Verzia MySQL
select @@version;

,@@version
0,5.7.34-37-log

In [29]:
-- Operacie aritmeticke + - / *
select 10-20;
-- Delenie realne
select 5/2;
-- Delenie celociselne
select 5 div 2;
-- Delenie so zvyskom/modulo
select 5 % 2;
select 5.0 / 0.0;

,5.0 / 0.0
0,None

In [32]:
-- describe World;
-- show columns from World;
show fields from World;

,Field,Type,Null,Key,Default,Extra
0,name,varchar(32),YES,,None,
1,continent,varchar(13),YES,,None,
2,area,int(11),YES,,None,
3,population,int(11),YES,,None,
4,gdp,varchar(11),YES,,None,
5,capital,varchar(25),YES,,None,
6,tld,varchar(3),YES,,None,
7,flag,varchar(94),YES,,None,

In [37]:
/*
1. Introducing the world table of countries

The example uses a WHERE clause to show the population of 'France'. Note that strings (pieces of text that are data) should be in 'single quotes';

Modify it to show the population of Germany/Slovakia
*/
select population
from World
where name = 'Slovakia'

,population
0,5415949

In [46]:
/*
2. Scandinavia

Checking a list The word IN allows us to check if an item is in a list. The example shows the name and population for the countries 'Brazil', 'Russia', 'India' and 'China'.

Show the name and the population for 'Sweden', 'Norway' and 'Denmark'.
*/
select name, population
from World
where name in ('Sweden', 'Norway', 'Denmark')
-- order by population DESC -- ASC
order by RAND()

,name,population
0,Sweden,9675885
1,Norway,5124383
2,Denmark,5634437

In [51]:
/*
3. Just the right size
Which countries are not too small and not too big? BETWEEN allows range checking (range specified is inclusive of boundary values). The example below shows countries with an area of 250,000-300,000 sq. km. Modify it to show the country and the area for countries with an area between 200,000 and 250,000.
*/

select name, area
from World
-- where area between 200000 and 250000;
where area >= 200000 
and area <= 250000;

,name,area
0,Belarus,207600
1,Ghana,238533
2,Guinea,245857
3,Guyana,214969
4,Laos,236800
5,Romania,238391
6,Uganda,241550
7,United Kingdom,242900

In [54]:
select name, continent, area
from World
order by continent ASC, area DESC

,name,continent,area
0,Algeria,Africa,2381741
1,"Congo, Democratic Republic of",Africa,2345000
2,Sudan,Africa,1886068
3,Libya,Africa,1759540
4,Chad,Africa,1284000
...,...,...,...
190,Ecuador,South America,276841
191,Guyana,South America,214969
192,Uruguay,South America,181034
193,Suriname,South America,163820
194,Saint Vincent and the Grenadines,South America,389

In [58]:
SELECT Name, population
from World
-- where name in ('Sweden', 'Norway', 'Denmark')
where name = 'Sweden'
or name = 'Norway'
or name = 'Denmark'

,Name,population
0,Denmark,5634437
1,Norway,5124383
2,Sweden,9675885

In [68]:
/*
1. You can use WHERE name LIKE 'B%' to find the countries that start with "B".

The % is a wild-card it can match any characters
Find the country that start with Y
*/

select name, capital
from World
-- where name like "Afganistan"
-- where name like "A%"
-- where name like "%A"
-- where name like "%A%"
where name like "Y%"

,name,capital
0,Yemen,Sana‘a

In [71]:
/*
2. Find the countries that end with y
*/

select name, capital
from World
where name like "%y"

,name,capital
0,Germany,Bonn
1,Hungary,Budapest
2,Italy,Rome
3,Norway,Oslo
4,Paraguay,Asunción
5,Turkey,Ankara
6,Uruguay,Montevideo
7,Vatican City,

In [73]:
/*
3. Luxembourg has an x - so does one other country. List them both.

Find the countries that contain the letter x
*/

select name
from World
where name like "%x%"

,name
0,Luxembourg
1,Mexico

In [74]:
/*
4. Iceland, Switzerland end with land - but are there others?

Find the countries that end with land
*/

select name
from World
where name like "%land"

,name
0,Finland
1,Iceland
2,Ireland
3,New Zealand
4,Poland
5,Swaziland
6,Switzerland
7,Thailand

In [78]:
/*
5. Columbia starts with a C and ends with ia - there are two more like this.

Find the countries that start with C and end with ia
*/

select name
from World
where name like "C%ia"

,name
0,Cambodia
1,Colombia
2,Croatia

In [79]:
/*
6. Greece has a double e - who has a double o?

Find the country that has oo in the name
*/

select name
from World
where name like "%oo%"

,name
0,Cameroon

In [80]:
/* 7. Bahamas has three a - who else?

Find the countries that have three or more a in the name
*/

select name
from World
where name like "%a%a%a%"

,name
0,Afganistan
1,Albania
2,Antigua and Barbuda
3,Australia
4,Azerbaijan
5,Bahamas
6,Bosnia and Herzegovina
7,Canada
8,Central African Republic
9,Equatorial Guinea
10,Guatemala
11,Jamaica
12,Kazakhstan
13,Madagascar
14,Malaysia
15,Marshall Islands
16,Mauritania
17,"Micronesia, Federated States of"
18,Nicaragua
19,Panama
20,Papua New Guinea
21,Paraguay
22,Saint Vincent and the Grenadines
23,Saudi Arabia
24,Tanzania
25,Trinidad and Tobago
26,United Arab Emirates

In [82]:
/*
8. India and Angola have an n as the second character. You can use the underscore as a single character wildcard.
*/

select name
from World
where name like "_n%"
AND name like "a%"

,name
0,Andorra
1,Angola
2,Antigua and Barbuda

In [83]:
/*
9. Lesotho and Moldova both have two o characters separated by two other characters.

Find the countries that have two "o" characters separated by two others.
*/

select name
from World
where name like "%o__o%"

,name
0,"Congo, Democratic Republic of"
1,"Congo, Republic of"
2,Lesotho
3,Moldova
4,Mongolia
5,Morocco
6,Sao Tomé and Príncipe

In [84]:
/*
10. Cuba and Togo have four characters names.

Find the countries that have exactly four characters.
*/

select name
from World
where name like "____"

,name
0,Chad
1,Cuba
2,Fiji
3,Iran
4,Iraq
5,Laos
6,Mali
7,Oman
8,Peru
9,Togo

In [87]:
/* 11. The capital of Luxembourg is Luxembourg. Show all the countries where the capital is the same as the name of the country

Find the country where the name is the capital city.
*/

SELECT name
  FROM World
 WHERE name LIKE capital

,name
0,Djibouti
1,Luxembourg
2,San Marino
3,Singapore